RT-Thread/rt-thread/bsp/nuvoton_m451/Libraries/Device/Nuvoton/M451Series/Include/M451Series.h
#define SYS_NMISTS_EINT3_Pos             (11)                                              /*!< SYS_INT_T::NMISTS: EINT3 Position         */
#define SYS_NMISTS_EINT3_Msk             (0x1ul << SYS_NMISTS_EINT3_Pos )                  /*!< SYS_INT_T::NMISTS: EINT3 Mask             */

#define SYS_NMISTS_EINT4_Pos             (12)                                              /*!< SYS_INT_T::NMISTS: EINT4 Position         */
#define SYS_NMISTS_EINT4_Msk             (0x1ul << SYS_NMISTS_EINT4_Pos )                  /*!< SYS_INT_T::NMISTS: EINT4 Mask             */

#define SYS_NMISTS_EINT5_Pos             (13)                                              /*!< SYS_INT_T::NMISTS: EINT5 Position         */
#define SYS_NMISTS_EINT5_Msk             (0x1ul << SYS_NMISTS_EINT5_Pos )                  /*!< SYS_INT_T::NMISTS: EINT5 Mask             */

#define SYS_NMISTS_UART0_INT_Pos         (14)                                              /*!< SYS_INT_T::NMISTS: UART0_INT Position     */
#define SYS_NMISTS_UART0_INT_Msk         (0x1ul << SYS_NMISTS_UART0_INT_Pos )              /*!< SYS_INT_T::NMISTS: UART0_INT Mask         */

#define SYS_NMISTS_UART1_INT_Pos         (15)                                              /*!< SYS_INT_T::NMISTS: UART1_INT Position     */
#define SYS_NMISTS_UART1_INT_Msk         (0x1ul << SYS_NMISTS_UART1_INT_Pos )              /*!< SYS_INT_T::NMISTS: UART1_INT Mask         */

/**@}*/ /* INT_CONST */
/**@}*/ /* end of SYS register group */


/*---------------------- Touch Key Controller -------------------------*/
/**
    @addtogroup TK Touch Key Controller(TK)
    Memory Mapped Structure for TK Controller
@{ */


typedef struct
{


/**
 * @var TK_T::CTL
 * Offset: 0x00  Touch Key Scan Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |TKSEN0    |TK0 Scan Enable Bit
 * |        |          |This bit is ignored if TKREN0 (TK_REFCTL[0]) is "1" except SCANALL (TK_REFCTL[23]) is "1".
 * |        |          |0 = TKDAT0 (TK_DAT0[7:0]) is invalid.
 * |        |          |1 = TK0 is always enable for Touch Key scan. TKDAT0 (TK_DAT0[7:0]) is valid.
 * |[1]     |TKSEN1    |TK1 Scan Enable Bit
 * |        |          |This bit is ignored if TKREN1 (TK_REFCTL[1]) is "1".
 * |        |          |0 = TKDAT1 (TK_DAT0[15:8]) is invalid.
 * |        |          |1 = TK1 is always enable for Touch Key scan. TKDAT1 (TK_DAT0[15:8]) is valid.
 * |[2]     |TKSEN2    |TK2 Scan Enable Bit
 * |        |          |This bit is ignored if TKREN2 (TK_REFCTL[2]) is "1".
 * |        |          |0 = TKDAT2 (TK_DAT0[23:16]) is invalid.
 * |        |          |1 = TK2 is always enable for Touch Key scan. TKDAT2 (TK_DAT0[23:16]) is valid.
 * |[3]     |TKSEN3    |TK3 Scan Enable Bit
 * |        |          |0 = TKDAT3 (TK_DAT0[31:24]) is invalid.
 * |        |          |1 = TK3 is always enable for Touch Key scan. TKDAT3 (TK_DAT0[31:24]) is valid.
 * |        |          |This bit is ignored if TKREN3 (TK_REFCTL[3]) is "1".
 * |[4]     |TKSEN4    |TK4 Scan Enable Bit
 * |        |          |This bit is ignored if TKREN4 (TK_REFCTL[4]) is "1".
 * |        |          |0 = TKDAT4 (TK_DAT1[7:0]) is invalid.
 * |        |          |1 = TK4 is always enable for Touch Key scan. TKDAT4 (TK_DAT1[7:0]) is valid.
 * |[5]     |TKSEN5    |TK5 Scan Enable Bit
 * |        |          |This bit is ignored if TKREN5 (TK_REFCTL[5]) is "1".
 * |        |          |0 = TKDAT5 (TK_DAT1[15:8]) is invalid.
 * |        |          |1 = TK5 is always enable for Touch Key scan. TKDAT5 (TK_DAT1[15:8]) is valid.
 * |[6]     |TKSEN6    |TK6 Scan Enable Bit
 * |        |          |This bit is ignored if TKREN6 (TK_REFCTL[6]) is "1".
 * |        |          |0 = TKDAT6 (TK_DAT1[23:16]) is invalid.
 * |        |          |1 = TK6 is always enable for Touch Key scan. TKDAT6 (TK_DAT1[23:16]) is valid.
 * |[7]     |TKSEN7    |TK7 Scan Enable
 * |        |          |This bit is ignored if TKREN7 (TK_REFCTL[7]) is "1".
 * |        |          |0 = TKDAT7 (TK_DAT1[31:24]) is invalid.
 * |        |          |1 = TK7 is always enable for Touch Key scan. TKDAT7 (TK_DAT1[31:24]) is valid.
 * |[8]     |TKSEN8    |TK8 Scan Enable Bit
 * |        |          |This bit is ignored if TKREN8 (TK_REFCTL[8]) is "1".
 * |        |          |0 = TKDAT8 (TK_DAT2[7:0]) is invalid.
 * |        |          |1 = TK8 is always enable for Touch Key scan. TKDAT8 (TK_DAT2[7:0]) is valid.
 * |[9]     |TKSEN9    |TK9 Scan Enable Bit
 * |        |          |This bit is ignored if TKREN9 (TK_REFCTL[9]) is "1".
 * |        |          |0 = TKDAT9 (TK_DAT2[15:8]) is invalid.
 * |        |          |1 = TK9 is always enable for Touch Key scan. TKDAT9 (TK_DAT2[15:8]) is valid.
 * |[10]    |TKSEN10   |TK10 Scan Enable Bit
 * |        |          |This bit is ignored if TKREN10 (TK_REFCTL[10]) is "1".
 * |        |          |0 = TKDAT10 (TK_DAT2[23:16]) is invalid.
 * |        |          |1 = TK10 is always enable for Touch Key scan. TKDAT10 (TK_DAT2[23:16]) is valid.
 * |[11]    |TKSEN11   |TK11 Scan Enable
 * |        |          |This bit is ignored if TKREN11 (TK_REFCTL[11]) is "1".
 * |        |          |0 = TKDAT11 (TK_DAT2[31:24]) is invalid.
 * |        |          |1 = TK11 is always enable for Touch Key scan. TKDAT11 (TK_DAT2[31:24]) is valid.
 * |[12]    |TKSEN12   |TK12 Scan Enable Bit
 * |        |          |This bit is ignored if TKREN12 (TK_REFCTL[12]) is "1".
 * |        |          |0 = TKDAT12 (TK_DAT3[7:0]) is invalid.
 * |        |          |1 = TK12 is always enable for Touch Key scan. TKDAT12 (TK_DAT3[7:0]) is valid.
 * |[13]    |TKSEN13   |TK13 Scan Enable Bit
 * |        |          |This bit is ignored if TKREN13 (TK_REFCTL[13]) is "1".
 * |        |          |0 = TKDAT13 (TK_DAT3[15:8]) is invalid.
 * |        |          |1 = TK13 is always enable for key scan. TKDAT13 (TK_DAT3[15:8]) is valid.
 * |[14]    |TKSEN14   |TK14 Scan Enable Bit
 * |        |          |This bit is ignored if TKREN14 (TK_REFCTL[14]) is "1".
 * |        |          |0 = TKDAT14 (TK_DAT3[23:16]) is invalid.
 * |        |          |1 = TK14 is always enabled for key scan. TKDAT14 (TK_DAT3[23:16]) is valid.
 * |[15]    |TKSEN15   |TK15 Scan Enable Bit
 * |        |          |This bit is ignored if TKREN15 (TK_REFCTL[15]) is "1".
 * |        |          |0 = TKDAT15 (TK_DAT3[31:24]) is invalid.
 * |        |          |1 = TK15 is always enabled for key scan. TKDAT15 (TK_DAT3[31:24]) is valid.
 * |[16]    |TKSEN16   |TK16 Scan Enable Bit
 * |        |          |This bit is ignored if TKREN16 (TK_REFCTL[16]) is "1".
 * |        |          |0 = TKDAT16 (TK_DAT4[7:0]) is invalid.
 * |        |          |1 = TK16 is always enabled for key scan. TKDAT16 (TK_DAT4[7:0]) is valid.
 * |[22:20] |AVCCHSEL  |AVCCH Voltage Select
 * |        |          |000 = 1/16 VDD.
 * |        |          |001 = 1/8 VDD.
 * |        |          |010 = 3/16 VDD.
 * |        |          |011 = 1/4 VDD.
 * |        |          |100 = 5/16 VDD.
 * |        |          |101 = 3/8 VDD.
 * |        |          |110 = 7/16 VDD.
 * |        |          |111 = 1/2 VDD.
 * |[24]    |SCAN      |Scan
 * |        |          |Write an '1' to this bit will immediately initiate key scan on all channels which are enabled.
 * |        |          |This bit will be self-cleared after key scan started.
 * |[25]    |TMRTRGEN  |Timer Trigger Enable Bit
 * |        |          |0 = Disable timer to trigger key scan.
 * |        |          |1 = Enable timer triggers key scan periodically. Key scan will be initiated by Timer0 periodically.
 * |[31]    |TKEN      |Touch Key Scan Enable Bit
 * |        |          |0 = Disable Touch Key Function.
 * |        |          |1 = Enable Touch Key Function.
 * @var TK_T::REFCTL
 * Offset: 0x04  Touch Key Reference Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |TKREN0    |TK0 Reference Enable Bit
 * |        |          |0 = TK0 is not reference.
 * |        |          |1 = TK0 is set as reference, and TKDAT0 (TK_DAT0[7:0]) is invalid except SCANALL (TK_REFCTL[23]) is "1".
 * |[1]     |TKREN1    |TK1 Reference Enable Bit
 * |        |          |0 = TK1 is not reference.
 * |        |          |1 = TK1 is set as reference, and TKDAT1 (TK_DAT0[15:8]) is invalid.
 * |[2]     |TKREN2    |TK2 Reference Enable Bit
 * |        |          |0 = TK2 is not reference.
 * |        |          |1 = TK2 is set as reference, and TKDAT2 (TK_DAT0[23:16]) is invalid.
 * |[3]     |TKREN3    |TK3 Reference Enable Bit
 * |        |          |0 = TK3 is not reference.
 * |        |          |1 = TK3 is set as reference, and TKDAT3 (TK_DAT0[31:24]) is invalid.
 * |[4]     |TKREN4    |TK4 Reference Enable Bit
 * |        |          |0 = TK4 is not reference.
 * |        |          |1 = TK4 is set as reference, and TKDAT4 (TK_DAT1[7:0]) is invalid.
 * |[5]     |TKREN5    |TK5 Reference Enable Bit
 * |        |          |0 = TK5 is not reference.
 * |        |          |1 = TK5 is set as reference, and TKDAT5 (TK_DAT1[15:8]) is invalid.
 * |[6]     |TKREN6    |TK6 Reference Enable Bit
 * |        |          |0 = TK6 is not reference.
 * |        |          |1 = TK6 is set as reference, and TKDAT6 (TK_DAT1[23:16]) is invalid.
 * |[7]     |TKREN7    |TK7 Reference Enable Bit
 * |        |          |0 = TK7 is not reference.
 * |        |          |1 = TK7 is set as reference, and TKDAT7 (TK_DAT1[31:24]) is invalid.
 * |[8]     |TKREN8    |TK8 Reference Enable Bit
 * |        |          |0 = TK8 is not reference.
 * |        |          |1 = TK8 is set as reference, and TKDAT8 (TK_DAT2[7:0]) is invalid.
 * |[9]     |TKREN9    |TK9 Reference Enable Bit
 * |        |          |0 = TK9 is not reference.
 * |        |          |1 = TK9 is set as reference, and TKDAT9 (TK_DAT2[15:8]) is invalid.
 * |[10]    |TKREN10   |TK10 Reference Enable Bit
 * |        |          |0 = TK10 is not reference.
 * |        |          |1 = TK10 is set as reference, and TKDAT10 (TK_DAT2[23:16]) is invalid.
 * |[11]    |TKREN11   |TK11 Reference Enable Bit
 * |        |          |0 = TK11 is not reference.
 * |        |          |1 = TK11 is set as reference, and TKDAT11 (TK_DAT2[31:24]) is invalid.
 * |[12]    |TKREN12   |TK12 Reference Enable Bit
 * |        |          |0 = TK12 is not reference.
 * |        |          |1 = TK12 is set as reference, and TKDAT12 (TK_DAT3[7:0]) is invalid.
 * |[13]    |TKREN13   |TK13 Reference Enable Bit
 * |        |          |0 = TK13 is not reference.
 * |        |          |1 = TK13 is set as reference, and TKDAT13 (TK_DAT3[15:8]) is invalid.
 * |[14]    |TKREN14   |TK14 Reference Enable Bit
 * |        |          |0 = TK14 is not reference.
 * |        |          |1 = TK14 is set as reference, and TKDAT14 (TK_DAT3[23:16]) is invalid.
 * |[15]    |TKREN15   |TK15 Reference Enable Bit
 * |        |          |0 = TK15 is not reference.
 * |        |          |1 = TK15 is set as reference, and TKDAT15 (TK_DAT3[31:24]) is invalid.
 * |[16]    |TKREN16   |TK16 Reference Enable Bit
 * |        |          |0 = TK16 is not reference.
 * |        |          |1 = TK16 is set as reference, and TKDAT16 (TK_DAT4[7:0]) is invalid.
 * |        |          |Note: This bit is forced to "1" automatically if none is set as reference.
 * |[23]    |SCANALL   |All Key Scan Enable Bit
 * |        |          |This function is used for low power key scanning operation.
 * |        |          |TKDAT0 (TK_DAT0[7:0]) is the only one valid data when key scan is complete.
 * |        |          |0 = Disable All Keys Scan function.
 * |        |          |1 = Enable All Keys Scan function.
 * |[25:24] |SENTCTL   |Touch Key Sensing Time Control
 * |        |          |00 = 128 x SENPTCTL.
 * |        |          |01 = 255 x SENPTCTL.
 * |        |          |10 = 511 x SENPTCTL.
 * |        |          |11 = 1023 x SENPTCTL.
 * |[29:28] |SENPTCTL  |Touch Key Sensing Pulse Width Time Control
 * |        |          |00 = 1us.
 * |        |          |01 = 2us.
 * |        |          |10 = 4us.
 * |        |          |11 = 8us.
 * @var TK_T::CCBDAT0
 * Offset: 0x08  Touch Key Complement Capacitor Bank Data Register 0
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |CCBDAT0   |TK0 Complement CB Data
 * |        |          |This is register is used for TK0 sensitivity adjustment.
 * |[15:8]  |CCBDAT1   |TK1 Complement CB Data
 * |        |          |This is register is used for TK1 sensitivity adjustment.
 * |[23:16] |CCBDAT2   |TK2 Complement CB Data
 * |        |          |This is register is used for TK2 sensitivity adjustment.
 * |[31:24] |CCBDAT3   |TK3 Complement CB Data
 * |        |          |This is register is used for TK3 sensitivity adjustment.
 * @var TK_T::CCBDAT1
 * Offset: 0x0C  Touch Key Complement Capacitor Bank Data Register 1
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |CCBDAT4   |TK4 Complement CB Data
 * |        |          |This is register is used for TK4 sensitivity adjustment.
 * |[15:8]  |CCBDAT5   |TK5 Complement CB Data
 * |        |          |This is register is used for TK5 sensitivity adjustment.
 * |[23:16] |CCBDAT6   |TK6 Complement CB Data
 * |        |          |This is register is used for TK6 sensitivity adjustment.
 * |[31:24] |CCBDAT7   |TK7 Complement CB Data
 * |        |          |This is register is used for TK7 sensitivity adjustment.
 * @var TK_T::CCBDAT2
 * Offset: 0x10  Touch Key Complement Capacitor Bank Data Register 2
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |CCBDAT8   |TK8 Complement CB Data
 * |        |          |This is register is used for TK8 sensitivity adjustment.
 * |[15:8]  |CCBDAT9   |TK9 Complement CB Data
 * |        |          |This is register is used for TK9 sensitivity adjustment.
 * |[23:16] |CCBDAT10  |TK10 Complement CB Data
 * |        |          |This is register is used for TK10 sensitivity adjustment.
 * |[31:24] |CCBDAT11  |TK11 Complement CB Data
 * |        |          |This is register is used for TK11 sensitivity adjustment.
 * @var TK_T::CCBDAT3
 * Offset: 0x14  Touch Key Complement Capacitor Bank Data Register 3
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |CCBDAT12  |TK12 Complement CB Data
 * |        |          |This is register is used for TK12 sensitivity adjustment.
 * |[15:8]  |CCBDAT13  |TK13 Complement CB Data
 * |        |          |This is register is used for TK13 sensitivity adjustment.
 * |[23:16] |CCBDAT14  |TK14 Complement CB Data
 * |        |          |This is register is used for TK14 sensitivity adjustment.
 * |[31:24] |CCBDAT15  |TK15 Complement CB Data
 * |        |          |This is register is used for TK15 sensitivity adjustment.
 * @var TK_T::CCBDAT4
 * Offset: 0x18  Touch Key Complement Capacitor Bank Data Register 4
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |CCBDAT16  |TK16 Complement CB Data
 * |        |          |This is register is used for TK16 sensitivity adjustment.
 * |[31:24] |REFCBDAT  |Reference CB Data
 * @var TK_T::IDLESEL
 * Offset: 0x1C  Touch Key Idle State Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[31:0]  |IDLSn     |TKn Idle State Control
 * |        |          |This register is ignored if both TKSENn (TK_CTL[n]) and POLENn (TK_POLCTL[n+8]) are "0" or TKRENn (TK_REFCTL[n]) is "1".
 * |        |          |00 = TKn connected to GND.
 * |        |          |01 = TKn connected to AVCCH.
 * |        |          |10 = TKn connected to VDD.
 * |        |          |11 = TKn connected to VDD.
 * |        |          |n = 0 to 15.
 * @var TK_T::POLSEL
 * Offset: 0x20  Touch Key Polarity Select Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[31:0]  |POLSELn   |TKn Polarity Select
 * |        |          |This register is ignored if POLENn (TK_POLCTL[n+8]) is "0", or either TKSENn (TK_CTL[n]) or TKRENn (TK_REFCTL[n]) is "1".
 * |        |          |00 = TKn connected to Gnd.
 * |        |          |01 = TKn connected to AVCCH.
 * |        |          |10 = TKn connected to VDD.
 * |        |          |11 = TKn connected to VDD.
 * @var TK_T::POLCTL
 * Offset: 0x24  Touch Key Polarity Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[1:0]   |IDLS16    |TK16 Idle State Control
 * |        |          |This register is ignored if both TKSEN16 (TK_CTL[16]) and POLEN16 (TK_POLCTL[24]) are "0" or TKREN16 (TK_REFCTL[16]) is "1".
 * |        |          |00 = TK16 connected to Gnd.
 * |        |          |01 = TK16 connected to AVCCH.
 * |        |          |10 = TK16 connected to VDD.
 * |        |          |11 = TK16 connected to VDD.
 * |[3:2]   |POLSEL16  |TK16 Polarity Control
 * |        |          |This register is ignored if POLEN16 (TK_POLCTL[24]) is "0", or either TKSEN16 (TK_CTL[16]) or TKREN16 (TK_REFCTL[16]) is "1".
 * |        |          |00 = TK16 connected to Gnd.
 * |        |          |01 = TK16 connected to AVCCH.
 * |        |          |10 = TK16 connected to VDD.
 * |        |          |11 = TK16 connected to VDD.
 * |[5:4]   |CBPOLSEL  |Capacitor Bank Polarity Select
 * |        |          |00 = Gnd.
 * |        |          |01 = AVCCH.
 * |        |          |10 = VDD.
 * |        |          |11 = VDD.
 * |[8]     |POLEN0    |TK0 Polarity Function Enable Control
 * |        |          |0 = Disabled.
 * |        |          |1 = Enabled.
 * |[9]     |POLEN1    |TK1 Polarity Function Enable Control
 * |        |          |0 = Disabled.
 * |        |          |1 = Enabled.
 * |[10]    |POLEN2    |TK2 Polarity Function Enable Control
 * |        |          |0 = Disabled.
 * |        |          |1 = Enabled.
 * |[11]    |POLEN3    |TK3 Polarity Function Enable Control
 * |        |          |0 = Disabled.
 * |        |          |1 = Enabled.
 * |[12]    |POLEN4    |TK4 Polarity Function Enable Control
 * |        |          |0 = Disabled.
 * |        |          |1 = Enabled.
 * |[13]    |POLEN5    |TK5 Polarity Function Enable Control
 * |        |          |0 = Disabled.
 * |        |          |1 = Enabled.
 * |[14]    |POLEN6    |TK6 Polarity Function Enable Control
 * |        |          |0 = Disabled.
 * |        |          |1 = Enabled.
 * |[15]    |POLEN7    |TK7 Polarity Function Enable Control
 * |        |          |0 = Disabled.
 * |        |          |1 = Enabled.
 * |[16]    |POLEN8    |TK8 Polarity Function Enable Control
 * |        |          |0 = Disabled.
 * |        |          |1 = Enabled.
 * |[17]    |POLEN9    |TK9 Polarity Function Enable Control
 * |        |          |0 = Disabled.
 * |        |          |1 = Enabled.
 * |[18]    |POLEN10   |TK10 Polarity Function Enable Control
 * |        |          |0 = Disabled.
 * |        |          |1 = Enabled.
 * |[19]    |POLEN11   |TK11 Polarity Function Enable Control
 * |        |          |0 = Disabled.
 * |        |          |1 = Enabled.
 * |[20]    |POLEN12   |TK12 Polarity Function Enable Control
 * |        |          |0 = Disabled.
 * |        |          |1 = Enabled.
 * |[21]    |POLEN13   |TK13 Polarity Function Enable Control
 * |        |          |0 = Disabled.
 * |        |          |1 = Enabled.
 * |[22]    |POLEN14   |TK14 Polarity Function Enable Control
 * |        |          |0 = Disabled.
 * |        |          |1 = Enabled.
 * |[23]    |POLEN15   |TK15 Polarity Function Enable Control
 * |        |          |0 = Disabled.
 * |        |          |1 = Enabled.
 * |[24]    |POLEN16   |TK16 Polarity Function Enable Control
 * |        |          |0 = Disabled.
 * |        |          |1 = Enabled.
 * |[31]    |SPOTINIT  |Touch Key Sensing Initial Potential Control
 * |        |          |0 = Key pad is connected to Gnd before sensing.
 * |        |          |1 = Key pad is connected to AVCCH before sensing.
 * @var TK_T::STATUS
 * Offset: 0x28  Touch Key Status Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |BUSY      |Touch Key Busy (Read Only)
 * |        |          |0 = Key scan is complete or stopped.
 * |        |          |1 = Key scan is proceeding.
 * |[1]     |SCIF      |Touch Key Scan Complete Interrupt Flag
 * |        |          |This bit will be cleared by writing a "1" to this bit.
 * |        |          |0 = Key scan is proceeding and data is not ready for read.
 * |        |          |1 = Key scan is complete and data is ready for read in TKDATx registers.
 * |        |          |Note1: The Touch Key interrupt asserts if SCINTEN bit of TK_INTEN register is set.
 * |        |          |Note2: The Touch Key interrupt also asserts if SCTHIEN bit of TK_INTEN register is set and any channel data value is greater/less than its threshold setting
 * |[8]     |TKIF0     |TK0 Interrupt Flag
 * |        |          |This bit will be cleared by writing a "1" to this bit.
 * |        |          |0 = No threshold control event with TK0.
 * |        |          |1 = Threshold control event occurs with TK0.
 * |[9]     |TKIF1     |TK1 Interrupt Flag
 * |        |          |This bit will be cleared by writing a "1" to this bit.
 * |        |          |0 = No threshold control event with TK1.
 * |        |          |1 = Threshold control event occurs with TK1.
 * |[10]    |TKIF2     |TK2 Interrupt Flag
 * |        |          |This bit will be cleared by writing a "1" to this bit.
 * |        |          |0 = No threshold control event with TK2.
 * |        |          |1 = Threshold control event occurs with TK2.
 * |[11]    |TKIF3     |TK3 Interrupt Flag
 * |        |          |This bit will be cleared by writing a "1" to this bit.
 * |        |          |0 = No threshold control event with TK3.
 * |        |          |1 = Threshold control event occurs with TK3.
 * |[12]    |TKIF4     |TK4 Interrupt Flag
 * |        |          |This bit will be cleared by writing a "1" to this bit.
 * |        |          |0 = No threshold control event with TK4.
 * |        |          |1 = Threshold control event occurs with TK4.
 * |[13]    |TKIF5     |TK5 Interrupt Flag
 * |        |          |This bit will be cleared by writing a "1" to this bit.
 * |        |          |0 = No threshold control event with TK5.
 * |        |          |1 = Threshold control event occurs with TK5.
 * |[14]    |TKIF6     |TK6 Interrupt Flag
 * |        |          |This bit will be cleared by writing a "1" to this bit.
 * |        |          |0 = No threshold control event with TK6.
 * |        |          |1 = Threshold control event occurs with TK6.
 * |[15]    |TKIF7     |TK7 Interrupt Flag
 * |        |          |This bit will be cleared by writing a "1" to this bit.
 * |        |          |0 = No threshold control event with TK7.
 * |        |          |1 = Threshold control event occurs with TK7.
