RT-Thread/rt-thread/bsp/nuvoton_m451/Libraries/Device/Nuvoton/M451Series/Include/M451Series.h
#ifndef NULL
#define NULL        0
#endif

#include "sys.h"
#include "clk.h"
#include "gpio.h"
#include "i2c.h"
#include "crc.h"
#include "ebi.h"
#include "rtc.h"
#include "timer.h"
#include "wdt.h"
#include "wwdt.h"
#include "spi.h"
#include "sc.h"
#include "scuart.h"
#include "acmp.h"
#include "eadc.h"
#include "dac.h"
#include "can.h"
#include "usbd.h"
#include "fmc.h"
#include "uart.h"
#include "pwm.h"
#include "pdma.h"
#include "tk.h"
#include "otg.h"

typedef volatile unsigned char  vu8;
typedef volatile unsigned long  vu32;
typedef volatile unsigned short vu16;
#define M8(adr)  (*((vu8  *) (adr)))
#define M16(adr) (*((vu16 *) (adr)))
#define M32(adr) (*((vu32 *) (adr)))

#define outpw(port,value)   (*((volatile unsigned int *)(port))=(value))
#define inpw(port)          (*((volatile unsigned int *)(port)))
#define outpb(port,value)   (*((volatile unsigned char *)(port))=(value))
#define inpb(port)          (*((volatile unsigned char *)(port)))
#define outps(port,value)   (*((volatile unsigned short *)(port))=(value))
#define inps(port)          (*((volatile unsigned short *)(port)))

#define outp32(port,value)  (*((volatile unsigned int *)(port))=(value))
#define inp32(port)         (*((volatile unsigned int *)(port)))
#define outp8(port,value)   (*((volatile unsigned char *)(port))=(value))
#define inp8(port)          (*((volatile unsigned char *)(port)))
#define outp16(port,value)  (*((volatile unsigned short *)(port))=(value))
#define inp16(port)         (*((volatile unsigned short *)(port)))

/*@}*/ /* end of group PeripheralDecl */

#ifdef __cplusplus
}
#endif

#endif  /* __M451SERIES_H__ */

/*** (C) COPYRIGHT 2014~2015 Nuvoton Technology Corp. ***/



